{
  "assignment_id": 790778,
  "title": "2024 Incident Scenerios",
  "meta": {
    "raw_header": "Assignment: 2024 Incident Scenerios\n\nPoints: 100.0\nSubmission Types: online_upload",
    "points": 100.0,
    "submission_types": [
      "online_upload"
    ]
  },
  "scenarios": [
    {
      "name": "Cloud Storage",
      "scenario": "One of your organization’s internal departments frequently uses outside cloud storage to store large amounts of data, some of which may be sensitive. You have recently learned that the cloud storage provider being used has been publicly compromised and large amounts of data have been exposed. All user passwords and data in the cloud provider’s infrastructure may have been compromised.How do you respond?",
      "containment": "What strategy should the organization take to contain the incident? Why is this strategy preferable to others?\n\nWhat could happen if the incident were not contained?\n\nWhat additional tools and organizations might be needed to respond to this particular incident?",
      "post_incident_activities": "What could be done to prevent similar incidents from occurring in the future?\n\nWhat could be done to improve detection of similar incidents?\n\nWhat could be done to improve containment of similar incidents?",
      "elevator_pitch": "Your strategy to contain the attack.\n\nWhat additional tools and resources you would need.\n\nWhat your group learned."
    },
    {
      "name": "PII Accident",
      "scenario": "You receive news that one of your employees has accidentally disclosed sensitive personally identifiable information (PII) for over 200 clients and personnel. This occurred when they emailed a document that had not been properly scrubbed to a contractor. The employee had been recently trained on PII handling.How do you respond?",
      "containment": "What strategy should the organization take to contain the incident?\n\nWhy is this strategy preferable to others?\n\nWhat could happen if the incident were not contained?\n\nWhat additional tools and organizations might be needed?",
      "post_incident_activities": "How to prevent similar incidents in the future?\n\nHow to improve detection of similar incidents?\n\nHow to improve containment for similar incidents?",
      "elevator_pitch": "Your strategy to contain the attack.\n\nTools/resources needed.\n\nWhat your group learned."
    },
    {
      "name": "Social Media",
      "scenario": "Your organization’s social media website is compromised. A terrorist group calling themselves “Rebellion Cyber Forces” has claimed responsibility for attacks against government organizations. They have gained control of your organization’s official social media account and are sending public notifications claiming your organization has been compromised.How do you respond?",
      "containment": "Strategy to contain the incident and why.\n\nWhat happens if the incident isn't contained?\n\nAdditional tools/organizations needed?",
      "post_incident_activities": "How to prevent similar incidents?\n\nHow to improve detection?\n\nHow to improve containment?",
      "elevator_pitch": "Your strategy to contain the attack.\n\nTools/resources needed.\n\nWhat your group learned."
    },
    {
      "name": "Zero-Day",
      "scenario": "The browser deployed on all organizational workstations has a significant zero-day vulnerability being actively exploited. Ten workstations are already compromised and help desk calls are spiking. No patch or workaround exists yet; a patch is expected in one week.How do you respond?",
      "containment": "Recommended containment strategy and why.\n\nRisks if not contained.\n\nAdditional tools/organizations needed?",
      "post_incident_activities": "Prevention of similar incidents.\n\nImproved detection.\n\nImproved containment.",
      "elevator_pitch": "Containment strategy.\n\nTools/resources required.\n\nWhat your group learned."
    }
  ]
}